import { createStore } from "vuex"

export default createStore({
    state() {
        return {
            num: 1,
            头盔: [
                '自选', 
                ['【零号大坝-普通】带出', '【长弓溪谷-普通】带出'],
                ['H70 精英头盔', 'Mask-1铁壁头盔', 'H09 防暴头盔', 'DICH-1战术头盔', 'GN 重型头盔', 'GN 重型夜视头盔', 'GN 久战重型夜视头盔', 'D6 战术头盔', 'MHS 战术头盔', 'DICH 训练头盔', 'GT1 战术头盔', '防暴头盔', 'H07 战术头盔', 'DAS 防弹头盔', 'MC201 头盔', '复古摩托头盔', 'H01 战术头盔', 'DRO 战术头盔', 'MC防弹头盔', '老式钢盔', '安保头盔', '奔尼帽', '户外棒球帽'],
            ],
            护甲: [
                '自选', 
                ['【零号大坝-普通】带出', '【长弓溪谷-普通】带出'],
                ['HA-2防弹装甲', '精英防弹背心', 'Hvk-2防弹衣', 'FS复合防弹衣', '重型突击背心', '武士防弹背心', '突击手防弹背心', 'DT-AVS防弹衣', 'MK-2战术背心', 'HMP特勤防弹衣', '制式防弹背心', 'Hvk快拆防弹衣', 'TG-H防弹衣', '射手战术背心', '简易防刺服', 'HT战术背心', 'TG战术防弹衣', '通用战术背心', '摩托马甲', '安保防弹衣', '尼龙防弹衣', '轻型防弹衣'],
            ],
            胸挂: [
                '自选', 
                ['【零号大坝-普通】带出', '【长弓溪谷-普通】带出'],
                ['便携胸包', '快速侦察胸挂', '轻型战术胸挂', '简易挂载包', '尼龙挎包', 'HK3便携胸挂', 'D01轻型胸挂', '通用战术胸挂', '简易携行弹挂', 'HD3战术胸挂', 'DSA战术胸挂', 'G01战术弹挂', '强袭战术背心', '突击者战术背心', 'DRC先进侦察胸挂', 'GIR野战胸挂'],
            ],
            背包: [
                '自选', 
                ['【零号大坝-普通】带出', '【长弓溪谷-普通】带出'],
                ['斜挎包', '运动背包', '旅行背包', 'DG运动背包', '帆布背囊', '轻型户外背包', '战术快拆背包', '突袭战术背包', '露营背包', '大型登山包', '3H战术背包', 'DASH战术背包', 'GA野战背包', '雨林猎手背包', 'MAP侦察背包', '野战徒步背包', 'D2战术登山包', 'GT1户外登山包', '生存战术背包', 'ALS背负系统', 'HLS-2重型背包', 'D3战术登山包', 'GT5野战背包', '重型登山包'],
            ],
            枪械: [
                '自选', 
                ['【零号大坝-普通】带出', '【长弓溪谷-普通】带出'],
                ['725双管霰弹枪', 'Vector冲锋枪', 'MP7', 'P90冲锋枪', 'QCQ171冲锋枪', 'AS Val突击步枪', 'SR-3M紧凑突击步枪', 'G18', 'M14射手步枪', 'ASh-12战斗步枪', '勇士冲锋枪', 'S12K霰弹枪', 'K416突击步枪', 'K437突击步枪', 'M7战斗步枪', 'MP5冲锋枪', 'M4A1突击步枪', '腾龙突击步枪', 'M1014霰弹枪', 'AKM突击步枪', 'SKS射手步枪', 'AUG突击步枪', 'M16A4突击步枪', '93R', 'SCAR-H战斗步枪', 'PKM通用机枪', 'SG552突击步枪', '野牛冲锋枪', 'AK-12突击步枪', 'PTR-32突击步枪', 'G3战斗步枪', 'SMG-45冲锋枪', 'QBZ95-1突击步枪', 'Mini-14射手步枪', 'SR-25射手步枪', 'AKS-74U突击步枪', 'CAR-15突击步枪', 'M250通用机枪', 'VSS射手步枪', 'SVD狙击步枪', 'PSG-1射手步枪', 'M249轻机枪', 'M1911', 'QJB201轻机枪', 'SR9射手步枪', 'QSZ92G', 'UZI冲锋枪', 'G17', '沙漠之鹰', 'M870霰弹枪', '.357左轮', 'AWM狙击步枪', 'R93狙击步枪', 'M700狙击步枪', 'SV-98狙击步枪'],
            ],
            地图: [
                '自选', 
                ['零号大坝-机密', '零号大坝-绝密', '零号大坝-长夜', '零号大坝-终夜', '长弓溪谷-机密', '巴克什-机密', '巴克什-绝密', '航天基地-机密', '航天基地-绝密'],
            ],
            干员: [
                '自选', 
                ['红狼', '威龙', '蜂医', '乌鲁鲁', '卢娜', '牧羊人'],
            ],
            子弹: [
                '自选',
            ],
            任务: [
                '无', 
                ['破坏物资室铁门', '淘汰高价值目标', '清理目标区域', '开启保险箱'],
            ],
            撤离: [
                '自选', 
                ['任务', '拉闸', '付费', '丢包'],
            ],
        }
    },
    getters: {
        doubleNum(state) {
            return state.num * 2
        },
        干员(state) {
            return state.干员[Math.floor(Math.random() * state.干员.length)]
        },
        地图(state) {
            return state.地图[Math.floor(Math.random() * state.地图.length)]
        },
        rand: (state) => (type: '干员'|'地图'|'枪械'|'头盔'|'护甲'|'胸挂') => { // 干员: string[]; 地图: string[]; 枪械: string[]; 头盔: string[]; 护甲
            let data: string| string[] = state[type] as unknown as string| string[];
            while(typeof data != 'string') {
                data = (data as string[])[Math.floor(Math.random() * (data as string[]).length)];
            }
            return data
        }
    },
    mutations: {
        addNum(state) {
            state.num++
        }
    },
    actions: {},
    modules: {}
})